In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    {    
        "ID": [101, 102, 103, 104],
        "Name": ['Alice', 'Bob', 'Charlie', 'Diana'], 
        "Base_salary": [5000, 6000, 5500, 7000], 
        "Bonuses": [5000, 4000, 3000, 7000]
    }
)

In [4]:
df.head()

    ID     Name  Base_salary  Bonuses
0  101    Alice         5000     5000
1  102      Bob         6000     4000
2  103  Charlie         5500     3000
3  104    Diana         7000     7000

In [7]:
df['Total_salary'] = df['Base_salary'] + df['Bonuses']
#df.'Total_salary' = df.'Base_salary' + df.'Bonuses'

In [6]:
df.head()

    ID     Name  Base_salary  Bonuses  Total_salary
0  101    Alice         5000     5000         10000
1  102      Bob         6000     4000         10000
2  103  Charlie         5500     3000          8500
3  104    Diana         7000     7000         14000